Revit 2027 API
FabricationPart.CutType Property
 The cut type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int CutType { get; }
Public ReadOnly Property CutType As Integer
	Get
public:
property int CutType {
	int get ();
}
member CutType : int with get
Property Value
Int32
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace